{"data":{"allContentfulTomWritesCodeBlog":{"edges":[{"node":{"intro":"raspberryCandy has been a project running in the background for about 2 months now. As of now. It's finished and published.","slug":"raspberrycandy-i-made-a-vs-code-theme","title":"raspberryCandy - I made a VS Code theme","updatedAt":"19-February-2019","post":{"post":"I have been interested in making a VS Code theme for a while now and I started looking into it and saw an article by Sarah Drasner on CSS Tricks which got the ball rolling. \n\nGoing through some more articles and I got the ball rolling for raspberryCandy, my neon/pastel theme. The name comes from my favourite blend of coffee from ONA in Marrickville, Australia.\n\n![screenShot](//images.ctfassets.net/u434ytvnd3bo/2RH3azl2Z6YFdiXblptspp/ca7ef56f44963f787b4b8775353363a0/screenShot.png)\n\nAnd now it's all done! I am really happy with how it has turned out, It has been a really good project to work on. \n\nBelow is a list of the links I used that helped me get it into the marketplace.\n\n- [Creating a VS Code Theme - Sarah Drasner - CSS Tricks](https://css-tricks.com/creating-a-vs-code-theme/?fbclid=IwAR1qhdXb01kZdZZn8HB5KY0nLtRCRobG21u1BxGAxG2xoLYp7HRcpRN1SiE \"Sarah Drasner's Article on building a VS Code theme for CSS Tricks\")\n\n- [VS Code Docs (Really helpful with all the detail of interactions and what changes what.](https://code.visualstudio.com/api/references/theme-color?fbclid=IwAR1aId1wnpMRtGQOlEP7A1UOOJebFOQm6nP8GpTfylEl2BKEgb4sYdAlfWo \"VS Code Docs\") \n\n- [VS Code Extension Manifest (List of all the things that are needed and optional in a theme package)](https://code.visualstudio.com/api/references/extension-manifest?fbclid=IwAR2omxhZzfqPQfD08SqOHlSdXRPOocZvfYA5n-2FBeM0Dk-WAoeLAS9H46w \"VS Code Extension Manifest.\") "}}},{"node":{"intro":"Well, if you're reading this that can only mean one thing. I finally built the damn site. ","slug":"wasnt-build-in-a-day","title":"tomWritesCode wasn't built in a day.","updatedAt":"22-January-2019","post":{"post":"This is a personal website for me has always been the thing I have needed to build the most but prioritised the least. This should cover the website that took forever to build. \n\n\nSo, tomWritesCode, a site to house my blog, and just some basic stuff about me. It only took what felt like 300 years to make, a series of pushbacks due to other things I wanted to make and the constant learning of new things which makes more revisions etc, etc, (I'm sure that if you have ever made your own site you will know the feeling.)\n\n\nI went with a neon theme after playing around with a flicker animation for an idea, now it's the base of my whole site. the flicker annimation is using keyframes and there is another class for a delay to use the same animation on the same page.\n"}}}]}}}